; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l17_p17_c17_g17_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate medicine crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(person-at person1 loc14)
	(person-at person2 loc12)
	(person-at person3 loc2)
	(person-at person4 loc14)
	(person-at person5 loc2)
	(person-at person6 loc3)
	(person-at person7 loc14)
	(person-at person8 loc15)
	(person-at person9 loc12)
	(person-at person10 loc4)
	(person-at person11 loc13)
	(person-at person12 loc7)
	(person-at person13 loc5)
	(person-at person14 loc12)
	(person-at person15 loc17)
	(person-at person16 loc9)
	(person-at person17 loc17)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person3 food)
	(has-content-person person4 food)
	(has-content-person person5 food)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person10 food)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person16 food)
	(has-content-person person17 food)
))
)

; plan
1. (put-crate-in-carrier crate17 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space4)
   goals met: 1 of 18
2. (put-crate-in-carrier crate14 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space3)
   goals met: 1 of 18
3. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 0 of 18
4. (pick-and-drop crate14 loc15 drone1 carrier1 space3 person8 food)
   deleted: (crate-at-space crate14 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person8 food)
   goals met: 1 of 18
5. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 18
6. (put-crate-in-carrier crate13 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space3)
   goals met: 2 of 18
7. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 1 of 18
8. (pick-and-drop crate13 loc13 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate13 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 2 of 18
9. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 18
10. (put-crate-in-carrier crate12 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space3)
   goals met: 3 of 18
11. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 2 of 18
12. (pick-and-drop crate12 loc9 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate12 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 3 of 18
13. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 18
14. (put-crate-in-carrier crate11 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space3)
   goals met: 4 of 18
15. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 3 of 18
16. (pick-and-drop crate11 loc7 drone1 carrier1 space3 person12 food)
   deleted: (crate-at-space crate11 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person12 food)
   goals met: 4 of 18
17. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 18
18. (put-crate-in-carrier crate10 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space3)
   goals met: 5 of 18
19. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 4 of 18
20. (pick-and-drop crate10 loc4 drone1 carrier1 space3 person10 food)
   deleted: (crate-at-space crate10 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person10 food)
   goals met: 5 of 18
21. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 18
22. (put-crate-in-carrier crate9 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space3)
   goals met: 6 of 18
23. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 5 of 18
24. (pick-and-drop crate17 loc3 drone1 carrier1 space4 person6 medicine)
   deleted: (crate-at-space crate17 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person6 medicine)
   goals met: 6 of 18
25. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 18
26. (put-crate-in-carrier crate16 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space4)
   goals met: 7 of 18
27. (put-crate-in-carrier crate15 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space2)
   goals met: 7 of 18
28. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 6 of 18
29. (pick-and-drop crate15 loc14 drone1 carrier1 space2 person1 medicine)
   deleted: (crate-at-space crate15 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 medicine)
   goals met: 7 of 18
30. (move-carrier loc14 loc2 drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 7 of 18
31. (pick-and-drop crate16 loc2 drone1 carrier1 space4 person5 medicine)
   deleted: (crate-at-space crate16 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 medicine)
   goals met: 8 of 18
32. (pick-and-drop crate9 loc2 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate9 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 9 of 18
33. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 18
34. (put-crate-in-carrier crate8 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space4)
   goals met: 10 of 18
35. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 9 of 18
36. (pick-and-drop crate8 loc2 drone1 carrier1 space4 person5 food)
   deleted: (crate-at-space crate8 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 food)
   goals met: 10 of 18
37. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 18
38. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 11 of 18
39. (put-crate-in-carrier crate6 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space3)
   goals met: 11 of 18
40. (move-carrier depot loc17 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   goals met: 10 of 18
41. (pick-and-drop crate6 loc17 drone1 carrier1 space3 person15 food)
   deleted: (crate-at-space crate6 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person15 food)
   goals met: 11 of 18
42. (pick-and-drop crate7 loc17 drone1 carrier1 space4 person17 food)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person17 food)
   goals met: 12 of 18
43. (move-carrier loc17 depot drone1 carrier1)
   deleted: (drone-at drone1 loc17) (carrier-at carrier1 loc17)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 18
44. (put-crate-in-carrier crate5 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space4)
   goals met: 13 of 18
45. (put-crate-in-carrier crate4 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space3)
   goals met: 13 of 18
46. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 12 of 18
47. (pick-and-drop crate4 loc14 drone1 carrier1 space3 person4 food)
   deleted: (crate-at-space crate4 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person4 food)
   goals met: 13 of 18
48. (pick-and-drop crate5 loc14 drone1 carrier1 space4 person7 food)
   deleted: (crate-at-space crate5 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person7 food)
   goals met: 14 of 18
49. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 15 of 18
50. (put-crate-in-carrier crate3 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space4)
   goals met: 15 of 18
51. (put-crate-in-carrier crate2 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space3)
   goals met: 15 of 18
52. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 14 of 18
53. (pick-and-drop crate2 loc12 drone1 carrier1 space3 person2 food)
   deleted: (crate-at-space crate2 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person2 food)
   goals met: 15 of 18
54. (pick-and-drop crate3 loc12 drone1 carrier1 space4 person9 food)
   deleted: (crate-at-space crate3 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person9 food)
   goals met: 16 of 18
55. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 18
56. (put-crate-in-carrier crate1 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space4)
   goals met: 17 of 18
57. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 16 of 18
58. (pick-and-drop crate1 loc12 drone1 carrier1 space4 person14 food)
   deleted: (crate-at-space crate1 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person14 food)
   goals met: 17 of 18
59. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 18 of 18
